# SlabEdgeType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabEdge..::..SlabEdgeType Property
SlabEdge Class See Also
---
Retrieves/set an object that represents the type of the SlabEdge.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabEdgeType SlabEdgeType { get; set; }
```

Visual Basic
---
```text
Public Property SlabEdgeType As SlabEdgeType
	Get
	Set
```

Visual C++
---
```text
public:
property SlabEdgeType^ SlabEdgeType {
	SlabEdgeType^ get ();
	void set (SlabEdgeType^ value);
}
```

# See Also
SlabEdge Class
Autodesk.Revit.DB Namespace